这里通过dict+list创建dataframe但是，dataframe一定是由多条series组成，且每个series内数据类型都可以不同.<br>当你用dict+list创建dataframe时候pandas会自动帮你把字典中的每一个list都转为Series

In [13]:
import pandas as pd
df1 = pd.DataFrame({
    '姓名': ['小陈', '小李', '小王', '小张', '小赵', '小周'],
    '性别': ['男', '女', '男', '男', '女', '女'],
    '身高': [172.5, 168.0, 178.2, 181.3, 161.7, 159.8],
    '成绩': [89, 92, 82, 96, 93, 84]
}, index=['001', '002', '003', '004', '005', '006'])
print(df1)

     姓名 性别     身高  成绩
001  小陈  男  172.5  89
002  小李  女  168.0  92
003  小王  男  178.2  82
004  小张  男  181.3  96
005  小赵  女  161.7  93
006  小周  女  159.8  84

In [14]:
df1

     姓名 性别     身高  成绩
001  小陈  男  172.5  89
002  小李  女  168.0  92
003  小王  男  178.2  82
004  小张  男  181.3  96
005  小赵  女  161.7  93
006  小周  女  159.8  84

# 对列赋值-既可以更新df的列也可以创建df新列

**值得注意的是若dataframe有标签索引时，那么你用Series对df列重新赋值时也必须要在加上相同的标签索引才可以把数据一一对应**

In [ ]:
df1["成绩"] = pd.Series([90, 91, 83, 95, 94, 85], index=["001", "002", "003", "004", "005", "006"])
df1

**除了series也可以用list对df中列的数据重新赋值，好处是无需再写index[]会按顺序一一对应，只需保证列表长度与df行数一致即可**

In [ ]:
df1["成绩"] = [900, 910, 830, 950, 940, 850]
df1

**对不存在于df中的列属性赋值时候会创建新列**

In [ ]:
df1["玩原神"] = pd.Series(['玩', '玩', '不玩', '玩', '玩', '不玩'], index=["001", "002", "003", "004", "005", "006"])
df1["游戏等级"] = [55, 59, 60, 38, 60, 54]
df1

# 对行赋值-既可以更新也可以创建

**用series对行进行赋值更新时要注意index[]要为df的属性，既可以iloc也可以loc**

In [ ]:
df1.loc['001'] = pd.Series(['小陈胜','男',172.55,899],index=['姓名','性别','身高','成绩'])
df1

In [ ]:
df1.iloc[1] = pd.Series(['小李广','男',172.55,899],index=['姓名','性别','身高','成绩'])
df1

**用list进行赋值更新时候可无需index[]既可按顺序一一对应可用loc/iloc，而series是带标签的数据结构最好每次都用index[]显示表现**

In [ ]:
df1.loc['003'] = ['小王莽','男',172.55,899]
df1

In [ ]:
df1.iloc[2] = ['小王莽','男',172.55,899]
df1

**对行进行赋值创建时候不可用iloc,只能用loc！**

In [ ]:
df1.loc['007'] = ['小莽','男',172.55,899]
df1

# 删除dataframe的行/列-drop()

*删除行时axis=0(不写它也行因为默认)，删除列时候为axis=1*

In [ ]:
df1.drop('005')

*.drop()仅显示删除后的dataframe，但并不改变原先dataframe中数据，可以赋值实现数据删除*

In [ ]:
df1

In [ ]:
df1 = df1.drop('005')
df1

In [ ]:
df1 = df1.drop(['006','007'])
df1

*对列进行删除，因为dataframe是一张表格由属性（列名→）+索引（↓）组成的二维数据结构<br>axis=0为默认，表示沿着索引纵向↓操作即对每一行数据操作，axis=1表示沿着属性横向操作即对每一个属性操作→<br>0↓  →1*

In [ ]:
df1.drop('成绩',axis=1)

In [ ]:
df1.drop(['性别','身高'],axis=1)

# df于df间的操作

*TIPS:<br>创建df时候，你先想好该df具备哪些属性并用 该属性英文名=pd.Series()创建出df的每一列<br>如果你还想要df有标签索引就要在Series中加个index[]<br>最后用dict将属性名作为关键字：对应series变量即属性英文名*

In [ ]:
A = pd.Series([0,4,8,12],index=['001','003','005','007'])
B = pd.Series([1,5,9,13],index=['001','003','005','007'])
C = pd.Series([2,6,10,14],index=['001','003','005','007'])
D = pd.Series([3,7,11,15],index=['001','003','005','007'])
df1 = pd.DataFrame({ 'a':A,'b':B,'c':C,'d':D})
df1

In [ ]:
A = pd.Series([0,3,6],index=['0','1','2'])
B = pd.Series([1,4,7],index=['0','1','2'])
C = pd.Series([2,5,8],index=['0','1','2'])
df2 = pd.DataFrame({ 'a':A,'b':B,'c':C})
df2

In [ ]:
df1 + df2

In [ ]:
A = pd.Series([0,3,6],index=['001','003','006'])
B = pd.Series([1,4,7],index=['001','003','006'])
C = pd.Series([2,5,8],index=['001','003','006'])
df3 = pd.DataFrame({ 'a':A,'b':B,'c':C})
df3

In [ ]:
df1+df3

*NaN即not a number索引未对得上，可以用fill_value来代替索引上对不上的值进行操作<br>df1.add(df2,fill_value=0)意思：当df1,df2在运算过程中发现df的一个值在另外一个df上有对不上的值时候就用0来代替那个对不上的值进行运算，而不是用NaN代替<br>因为会保留各df所有的属性与标签，所以会出现一个元素两个df都对不上此时用NaN表示*

In [ ]:
df1.add(df3,fill_value=0)

In [ ]:
df1.div(df3,fill_value=1)

In [ ]:
df1.mul(df3,fill_value=1)

In [ ]:
df1.sub(df3,fill_value=0)

# df与series操作

**是将Series的索引与DataFrame的列名对应,操作作用于df的每一行上**

In [17]:
s1 = pd.Series([0.1,1,10,100],index=['a','b','c','d'])
s1

a      0.1
b      1.0
c     10.0
d    100.0
dtype: float64

*你也可以用嵌套dict创建df最外层键名为df属性，里面的键名为标签索引，值为元素*

In [15]:
df1 = pd.DataFrame({
    'a':{'01':1,'02':2,'03':3},
    'b':{'01':1,'02':2,'03':3},
    'c':{'01':1,'02':2,'03':3},
})
df1

    a  b  c
01  1  1  1
02  2  2  2
03  3  3  3

In [18]:
df1 * s1

      a    b     c   d
01  0.1  1.0  10.0 NaN
02  0.2  2.0  20.0 NaN
03  0.3  3.0  30.0 NaN

**series中的a标签索引与df中a属性对应，操作作用于df的a属性下的每一行元素，只要这两个数据结构中有一个元素没有对应值就会nan**

In [ ]:
df1 * 10

In [ ]:
df1[['a','b']] *100

series与df操作的时候并不会像df和df间操作有fill_value这个变量可以把NaN消灭，当出现没有对应值的情况时会出现nan

**pandas会提取series标签索引映射的值x，再到df中找与series中标签名相同的属性下的各行数据a,b,c然后把x相应操作作用于abc上**

# 练习

#### 写出导入pandas的语句，并且给pandas别名为`pd`。

In [1]:
import pandas as pd

#### 创建一个名为`students`的DataFrame，包含数据如下：
```
{'001': {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},
 "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}
 }```
 
 #### 要求索引为学号（001、002等），列名为姓名、考试1、考试2、考试3，并输出创建好的DataFrame。

**通过内嵌dict创建df时最外一层键是df属性，里面的键是df的标签，里面的值是df的元素**

In [2]:
students = pd.DataFrame({
    
 "001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},
 "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}
 
})
students = students.T
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

#### 给`students`增加一列`考试4`，数据依次为：`[72, 69, 79, 83, 82, 76]`。

In [3]:
students['考试4']=[72, 69, 79, 83, 82, 76]
students

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   72
002  小李  91  92  94   69
003  小王  86  81  89   79
004  小张  79  89  95   83
005  小赵  96  91  91   82
006  小周  81  89  92   76

#### 给`students`添加一行，索引为007，数据为：`"小杨", 79, 82, 81, 69`。

In [4]:
students.loc['007']=["小杨", 79, 82, 81, 69]
students

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   72
002  小李  91  92  94   69
003  小王  86  81  89   79
004  小张  79  89  95   83
005  小赵  96  91  91   82
006  小周  81  89  92   76
007  小杨  79  82  81   69

#### 输出`students`删除索引为006、007的结果，但不要改变`students`本身。

In [5]:
students.drop(['006','007'])

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   72
002  小李  91  92  94   69
003  小王  86  81  89   79
004  小张  79  89  95   83
005  小赵  96  91  91   82

#### 输出`students`删除列名为“考试2”、“考试4”的结果，但不要改变`students`本身。

In [6]:
students.drop(['考试2','考试4'],axis=1)

     姓名 考试1 考试3
001  小陈  85  92
002  小李  91  94
003  小王  86  89
004  小张  79  95
005  小赵  96  91
006  小周  81  92
007  小杨  79  81

#### 创建一个Series`bonus`，包含的值和值对应的索引分别为：`{"考试1": 2, "考试2": 3, "考试3": 2, "考试4": 5}`。输出这个Series与`students`里所有分数列相加后的结果，但不用更新`students`。

In [7]:
bonus = pd.Series([2,3,2,5],index=['考试1','考试2','考试3','考试4'])
bonus+students[['考试1','考试2','考试3','考试4']]

    考试1 考试2 考试3  考试4
001  87  98  94   77
002  93  95  96   74
003  88  84  91   84
004  81  92  97   88
005  98  94  93   87
006  83  92  94   81
007  81  85  83   74

In [8]:
bonus+students

      姓名   考试1   考试2   考试3   考试4
001  NaN  87.0  98.0  94.0  77.0
002  NaN  93.0  95.0  96.0  74.0
003  NaN  88.0  84.0  91.0  84.0
004  NaN  81.0  92.0  97.0  88.0
005  NaN  98.0  94.0  93.0  87.0
006  NaN  83.0  92.0  94.0  81.0
007  NaN  81.0  85.0  83.0  74.0

#### 更新`students`的`考试4`，让每项数据值增加10，并输出更新后的结果。

In [11]:
students.考试4 = students['考试4']+10
students

     姓名 考试1 考试2 考试3  考试4
001  小陈  85  95  92   92
002  小李  91  92  94   89
003  小王  86  81  89   99
004  小张  79  89  95  103
005  小赵  96  91  91  102
006  小周  81  89  92   96
007  小杨  79  82  81   89